[Killed] Block removal mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:22:5
     private readonly RefundPolicy _refundPolicy;
 
     public CancellationService(IReservationRepository reservations, IClassRepository classes, RefundPolicy refundPolicy)
-    {
-        _reservations = reservations;
-        _classes = classes;
-        _refundPolicy = refundPolicy;
-    }
+    {}
 
     public async Task<CancelReservationResult> CancelAsync(Guid reservationId, DateTime cancelUtc, CancellationToken ct = default)
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_class_not_found_when_class_missing; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_conflict_when_already_cancelled

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:31:13
     public async Task<CancelReservationResult> CancelAsync(Guid reservationId, DateTime cancelUtc, CancellationToken ct = default)
     {
         var res = await _reservations.GetAsync(reservationId, ct);
-        if (res is null)
+        if (res is not null)
             return new(false, 0m, CancelReservationError.ReservationNotFound);
 
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_class_not_found_when_class_missing; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_conflict_when_already_cancelled

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:32:24
     {
         var res = await _reservations.GetAsync(reservationId, ct);
         if (res is null)
-            return new(false, 0m, CancelReservationError.ReservationNotFound);
+            return new(true, 0m, CancelReservationError.ReservationNotFound);
 
         if (res.CancelledAtUtc is not null)
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_not_found_when_reservation_missing

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:34:13
         if (res is null)
             return new(false, 0m, CancelReservationError.ReservationNotFound);
 
-        if (res.CancelledAtUtc is not null)
+        if (res.CancelledAtUtc is null)
             return new(false, 0m, CancelReservationError.AlreadyCancelled);
 
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_class_not_found_when_class_missing; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_conflict_when_already_cancelled

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:35:24
             return new(false, 0m, CancelReservationError.ReservationNotFound);
 
         if (res.CancelledAtUtc is not null)
-            return new(false, 0m, CancelReservationError.AlreadyCancelled);
+            return new(true, 0m, CancelReservationError.AlreadyCancelled);
 
         var cls = await _classes.GetAsync(res.ClassId, ct);
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_conflict_when_already_cancelled

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:38:13
             return new(false, 0m, CancelReservationError.AlreadyCancelled);
 
         var cls = await _classes.GetAsync(res.ClassId, ct);
-        if (cls is null)
+        if (cls is not null)
             return new(false, 0m, CancelReservationError.ClassNotFound);
 
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_class_not_found_when_class_missing

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:39:24
 
         var cls = await _classes.GetAsync(res.ClassId, ct);
         if (cls is null)
-            return new(false, 0m, CancelReservationError.ClassNotFound);
+            return new(true, 0m, CancelReservationError.ClassNotFound);
 
         var refund = _refundPolicy.GetRefundAmount(res.PricePaid, cls.StartAtUtc, cancelUtc);
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_returns_class_not_found_when_class_missing

[Killed] Statement mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:44:9
         var refund = _refundPolicy.GetRefundAmount(res.PricePaid, cls.StartAtUtc, cancelUtc);
 
         res.CancelledAtUtc = cancelUtc;
-        await _reservations.UpdateAsync(res, ct);
+        ;
 
         return new(true, refund, CancelReservationError.None);
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/CancellationService.cs:46:20
         res.CancelledAtUtc = cancelUtc;
         await _reservations.UpdateAsync(res, ct);
 
-        return new(true, refund, CancelReservationError.None);
+        return new(false, refund, CancelReservationError.None);
     }
 }
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds
