[Killed] Arithmetic mutation
FitnessBooking/src/FitnessBooking.Application/PricingCalculator.cs:32:21
             _ => throw new ArgumentOutOfRangeException(nameof(occupancy))
         };
 
-        var price = basePrice * timeMultiplier * occupancyMultiplier;
+        var price = basePrice / timeMultiplier * occupancyMultiplier;
         return Math.Round(price, 2, MidpointRounding.AwayFromZero);
     }
killedBy: FitnessBooking.UnitTests.DecisionTableTests.DT1_PricingCalculator_matches_decision_table(Standard,Peak,Low,120.0d); FitnessBooking.UnitTests.DecisionTableTests.DT1_PricingCalculator_matches_decision_table(Standard,Peak,Mid,132.0d); FitnessBooking.UnitTests.DecisionTableTests.DT1_PricingCalculator_matches_decision_table(Standard,Peak,High,156.0d)

[Killed] Arithmetic mutation
FitnessBooking/src/FitnessBooking.Application/PricingCalculator.cs:32:21
             _ => throw new ArgumentOutOfRangeException(nameof(occupancy))
         };
 
-        var price = basePrice * timeMultiplier * occupancyMultiplier;
+        var price = basePrice * timeMultiplier / occupancyMultiplier;
         return Math.Round(price, 2, MidpointRounding.AwayFromZero);
     }
killedBy: FitnessBooking.UnitTests.DecisionTableTests.DT1_PricingCalculator_matches_decision_table(Standard,OffPeak,Mid,110.0d); FitnessBooking.UnitTests.DecisionTableTests.DT1_PricingCalculator_matches_decision_table(Standard,OffPeak,High,130.0d); FitnessBooking.UnitTests.DecisionTableTests.DT1_PricingCalculator_matches_decision_table(Standard,Peak,Mid,132.0d)
