[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:11:13
     // < 2h: 0%
     public decimal GetRefundAmount(decimal pricePaid, DateTime classStartUtc, DateTime cancelUtc)
     {
-        if (pricePaid < 0) throw new ArgumentOutOfRangeException(nameof(pricePaid));
+        if (!(pricePaid < 0)) throw new ArgumentOutOfRangeException(nameof(pricePaid));
         if (cancelUtc > classStartUtc) return 0m; // cancelling after start => 0
 
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("GE24H",25,1.0d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d)

[Killed] Statement mutation
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:11:28
     // < 2h: 0%
     public decimal GetRefundAmount(decimal pricePaid, DateTime classStartUtc, DateTime cancelUtc)
     {
-        if (pricePaid < 0) throw new ArgumentOutOfRangeException(nameof(pricePaid));
+        if (pricePaid < 0) ;
         if (cancelUtc > classStartUtc) return 0m; // cancelling after start => 0
 
killedBy: FitnessBooking.UnitTests.RefundPolicyTests.GetRefundAmount_throws_when_pricePaid_is_negative

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:12:13
     public decimal GetRefundAmount(decimal pricePaid, DateTime classStartUtc, DateTime cancelUtc)
     {
         if (pricePaid < 0) throw new ArgumentOutOfRangeException(nameof(pricePaid));
-        if (cancelUtc > classStartUtc) return 0m; // cancelling after start => 0
+        if (cancelUtc < classStartUtc) return 0m; // cancelling after start => 0
 
         var delta = classStartUtc - cancelUtc;
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("GE24H",25,1.0d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d)

[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:12:13
     public decimal GetRefundAmount(decimal pricePaid, DateTime classStartUtc, DateTime cancelUtc)
     {
         if (pricePaid < 0) throw new ArgumentOutOfRangeException(nameof(pricePaid));
-        if (cancelUtc > classStartUtc) return 0m; // cancelling after start => 0
+        if (!(cancelUtc > classStartUtc)) return 0m; // cancelling after start => 0
 
         var delta = classStartUtc - cancelUtc;
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("GE24H",25,1.0d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d)

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:16:13
 
         var delta = classStartUtc - cancelUtc;
 
-        if (delta >= TimeSpan.FromHours(24)) return pricePaid;
+        if (delta < TimeSpan.FromHours(24)) return pricePaid;
         if (delta >= TimeSpan.FromHours(2)) return pricePaid * 0.5m;
         return 0m;
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("GE24H",25,1.0d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d)

[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:16:13
 
         var delta = classStartUtc - cancelUtc;
 
-        if (delta >= TimeSpan.FromHours(24)) return pricePaid;
+        if (!(delta >= TimeSpan.FromHours(24))) return pricePaid;
         if (delta >= TimeSpan.FromHours(2)) return pricePaid * 0.5m;
         return 0m;
killedBy: FitnessBooking.UnitTests.CancellationServiceTests.Cancel_happy_path_sets_cancelled_time_updates_and_refunds; FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("GE24H",25,1.0d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d)

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:17:13
         var delta = classStartUtc - cancelUtc;
 
         if (delta >= TimeSpan.FromHours(24)) return pricePaid;
-        if (delta >= TimeSpan.FromHours(2)) return pricePaid * 0.5m;
+        if (delta < TimeSpan.FromHours(2)) return pricePaid * 0.5m;
         return 0m;
     }
killedBy: FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("LT2H",1,0.0d); FitnessBooking.UnitTests.PairwisePricingRefundTests.Pairwise_case_produces_expected_price_and_refund(Student,Peak,Low,"H2_24H",84.0d,42.0d)

[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/RefundPolicy.cs:17:13
         var delta = classStartUtc - cancelUtc;
 
         if (delta >= TimeSpan.FromHours(24)) return pricePaid;
-        if (delta >= TimeSpan.FromHours(2)) return pricePaid * 0.5m;
+        if (!(delta >= TimeSpan.FromHours(2))) return pricePaid * 0.5m;
         return 0m;
     }
killedBy: FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("H2_24H",10,0.5d); FitnessBooking.UnitTests.DecisionTableTests.DT2_RefundPolicy_matches_decision_table("LT2H",1,0.0d); FitnessBooking.UnitTests.PairwisePricingRefundTests.Pairwise_case_produces_expected_price_and_refund(Student,Peak,Low,"H2_24H",84.0d,42.0d)
