[Killed] Block removal mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:30:5
         IMemberRepository members,
         IClassRepository classes,
         IReservationRepository reservations)
-    {
-        _members = members;
-        _classes = classes;
-        _reservations = reservations;
-    }
+    {}
 
     public async Task<CreateReservationResult> CreateAsync(
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassFull_when_capacity_is_zero_or_negative; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassNotFound_when_class_is_missing; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:43:13
         CancellationToken ct = default)
     {
         var member = await _members.GetAsync(memberId, ct);
-        if (member is null)
+        if (member is not null)
             return new(false, null, CreateReservationError.MemberNotFound);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassFull_when_capacity_is_zero_or_negative; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassNotFound_when_class_is_missing; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:44:24
     {
         var member = await _members.GetAsync(memberId, ct);
         if (member is null)
-            return new(false, null, CreateReservationError.MemberNotFound);
+            return new(true, null, CreateReservationError.MemberNotFound);
 
         var fitnessClass = await _classes.GetAsync(classId, ct);
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_MemberNotFound_when_member_is_missing

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:47:13
             return new(false, null, CreateReservationError.MemberNotFound);
 
         var fitnessClass = await _classes.GetAsync(classId, ct);
-        if (fitnessClass is null)
+        if (fitnessClass is not null)
             return new(false, null, CreateReservationError.ClassNotFound);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassFull_when_capacity_is_zero_or_negative; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassNotFound_when_class_is_missing; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:48:24
 
         var fitnessClass = await _classes.GetAsync(classId, ct);
         if (fitnessClass is null)
-            return new(false, null, CreateReservationError.ClassNotFound);
+            return new(true, null, CreateReservationError.ClassNotFound);
 
         if (fitnessClass.Capacity <= 0)
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassNotFound_when_class_is_missing

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:50:13
         if (fitnessClass is null)
             return new(false, null, CreateReservationError.ClassNotFound);
 
-        if (fitnessClass.Capacity <= 0)
+        if (fitnessClass.Capacity > 0)
             return new(false, null, CreateReservationError.ClassFull);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassFull_when_capacity_is_zero_or_negative; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists; FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:50:13
         if (fitnessClass is null)
             return new(false, null, CreateReservationError.ClassNotFound);
 
-        if (fitnessClass.Capacity <= 0)
+        if (!(fitnessClass.Capacity <= 0))
             return new(false, null, CreateReservationError.ClassFull);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassFull_when_capacity_is_zero_or_negative; FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists; FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:51:24
             return new(false, null, CreateReservationError.ClassNotFound);
 
         if (fitnessClass.Capacity <= 0)
-            return new(false, null, CreateReservationError.ClassFull);
+            return new(true, null, CreateReservationError.ClassFull);
 
         // Prevent duplicate active reservation for same member+class
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_ClassFull_when_capacity_is_zero_or_negative

[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:54:13
             return new(false, null, CreateReservationError.ClassFull);
 
         // Prevent duplicate active reservation for same member+class
-        if (await _reservations.ExistsActiveAsync(memberId, classId, ct))
+        if (!(await _reservations.ExistsActiveAsync(memberId, classId, ct)))
             return new(false, null, CreateReservationError.DuplicateReservation);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists; FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:55:24
 
         // Prevent duplicate active reservation for same member+class
         if (await _reservations.ExistsActiveAsync(memberId, classId, ct))
-            return new(false, null, CreateReservationError.DuplicateReservation);
+            return new(true, null, CreateReservationError.DuplicateReservation);
 
         // Capacity invariant
killedBy: FitnessBooking.UnitTests.ReservationServiceGuardTests.Returns_DuplicateReservation_when_active_reservation_exists

[Killed] Negate expression
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:59:13
 
         // Capacity invariant
         var activeCount = await _reservations.CountActiveForClassAsync(classId, ct);
-        if (activeCount >= fitnessClass.Capacity)
+        if (!(activeCount >= fitnessClass.Capacity))
             return new(false, null, CreateReservationError.ClassFull);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Equality mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:59:13
 
         // Capacity invariant
         var activeCount = await _reservations.CountActiveForClassAsync(classId, ct);
-        if (activeCount >= fitnessClass.Capacity)
+        if (activeCount > fitnessClass.Capacity)
             return new(false, null, CreateReservationError.ClassFull);
 
killedBy: FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:60:24
         // Capacity invariant
         var activeCount = await _reservations.CountActiveForClassAsync(classId, ct);
         if (activeCount >= fitnessClass.Capacity)
-            return new(false, null, CreateReservationError.ClassFull);
+            return new(true, null, CreateReservationError.ClassFull);
 
         var reservation = new Reservation
killedBy: FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Statement mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:70:9
             PricePaid = 0m
         };
 
-        await _reservations.AddAsync(reservation, ct);
+        ;
         return new(true, reservation.Id, CreateReservationError.None);
     }
killedBy: FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected

[Killed] Boolean mutation
FitnessBooking/src/FitnessBooking.Application/ReservationService.cs:71:20
         };
 
         await _reservations.AddAsync(reservation, ct);
-        return new(true, reservation.Id, CreateReservationError.None);
+        return new(false, reservation.Id, CreateReservationError.None);
     }
 }
killedBy: FitnessBooking.UnitTests.ReservationServiceTests.When_class_is_full_second_reservation_is_rejected
